#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Nokos/terraform-github/runs/run-omCQn13GQpCdAS35

Waiting for the plan to start...

Terraform v1.1.9
on linux_amd64
Initializing plugins and modules...
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources]
azurerm_virtual_network.main: Refreshing state... [id=/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Network/virtualNetworks/testTF-network]
azurerm_subnet.internal: Refreshing state... [id=/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Network/virtualNetworks/testTF-network/subnets/internal]
azurerm_network_interface.main: Refreshing state... [id=/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Network/networkInterfaces/testTF-nic]
azurerm_windows_virtual_machine.main: Refreshing state... [id=/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Compute/virtualMachines/testTF-vm]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_network_interface.main has changed
  ~ resource "azurerm_network_interface" "main" {
        id                            = "/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Network/networkInterfaces/testTF-nic"
      + mac_address                   = "00-0D-3A-55-66-85"
        name                          = "testTF-nic"
      + tags                          = {}
      + virtual_machine_id            = "/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Compute/virtualMachines/testTF-vm"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_subnet.internal has changed
  ~ resource "azurerm_subnet" "internal" {
        id                                             = "/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Network/virtualNetworks/testTF-network/subnets/internal"
        name                                           = "internal"
      + service_endpoint_policy_ids                    = []
      + service_endpoints                              = []
        # (5 unchanged attributes hidden)
    }

  # azurerm_virtual_network.main has changed
  ~ resource "azurerm_virtual_network" "main" {
        id                      = "/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Network/virtualNetworks/testTF-network"
        name                    = "testTF-network"
      ~ subnet                  = [
          + {
              + address_prefix = "10.0.2.0/24"
              + id             = "/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Network/virtualNetworks/testTF-network/subnets/internal"
              + name           = "internal"
              + security_group = ""
            },
          + {
              + address_prefix = "10.0.3.0/26"
              + id             = "/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Network/virtualNetworks/testTF-network/subnets/AzureBastionSubnet"
              + name           = "AzureBastionSubnet"
              + security_group = ""
            },
        ]
        tags                    = {}
        # (6 unchanged attributes hidden)
    }

  # azurerm_windows_virtual_machine.main has changed
  ~ resource "azurerm_windows_virtual_machine" "main" {
        id                         = "/subscriptions/100b4a3d-2952-4eba-95df-4cec49fafb1f/resourceGroups/testTF-resources/providers/Microsoft.Compute/virtualMachines/testTF-vm"
        name                       = "testTF-vm"
      + tags                       = {}
        # (23 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_automation_account.main will be created
  + resource "azurerm_automation_account" "main" {
      + dsc_primary_access_key        = (known after apply)
      + dsc_secondary_access_key      = (known after apply)
      + dsc_server_endpoint           = (known after apply)
      + id                            = (known after apply)
      + location                      = "eastus"
      + name                          = "testTF-autoacc"
      + public_network_access_enabled = true
      + resource_group_name           = "testTF-resources"
      + sku_name                      = "Basic"
    }

  # azurerm_automation_job_schedule.main will be created
  + resource "azurerm_automation_job_schedule" "main" {
      + automation_account_name = "testTF-autoacc"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + resource_group_name     = "testTF-resources"
      + runbook_name            = "Get-AzureVMTutorial"
      + schedule_name           = "testTF-hour"
    }

  # azurerm_automation_runbook.main will be created
  + resource "azurerm_automation_runbook" "main" {
      + automation_account_name = "testTF-autoacc"
      + content                 = (known after apply)
      + description             = "This is an example runbook"
      + id                      = (known after apply)
      + job_schedule            = (known after apply)
      + location                = "eastus"
      + log_progress            = true
      + log_verbose             = true
      + name                    = "Get-AzureVMTutorial"
      + resource_group_name     = "testTF-resources"
      + runbook_type            = "PowerShellWorkflow"

      + publish_content_link {
          + uri = "https://raw.githubusercontent.com/Azure/azure-quickstart-templates/c4935ffb69246a6058eb24f54640f53f69d3ac9f/101-automation-runbook-getvms/Runbooks/Get-AzureVMTutorial.ps1"
        }
    }

  # azurerm_automation_schedule.hour will be created
  + resource "azurerm_automation_schedule" "hour" {
      + automation_account_name = "testTF-autoacc"
      + expiry_time             = (known after apply)
      + frequency               = "Hour"
      + id                      = (known after apply)
      + interval                = 2
      + name                    = "testTF-hour"
      + resource_group_name     = "testTF-resources"
      + start_time              = (known after apply)
      + timezone                = "Etc/UTC"
    }

  # azurerm_automation_schedule.one-time will be created
  + resource "azurerm_automation_schedule" "one-time" {
      + automation_account_name = "testTF-autoacc"
      + expiry_time             = (known after apply)
      + frequency               = "OneTime"
      + id                      = (known after apply)
      + interval                = (known after apply)
      + name                    = "testTF-one-time"
      + resource_group_name     = "testTF-resources"
      + start_time              = (known after apply)
      + timezone                = "Etc/UTC"
    }

Plan: 5 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @Nokoshan, Action: `pull_request`*